# My SQL 연결

In [60]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\dkehs\anaconda3\lib\site-packages (1.0.2)

In [61]:
import pymysql

In [62]:
# MySQL Connection

conn = pymysql.connect(host="127.0.0.1", user ="root", passwd="qwer1234" , db = "education", charset="utf8")

In [63]:
curs = conn.cursor()

In [64]:
sql = "select * from student"
curs.execute(sql)

11

In [65]:
# Data Fetch
rows = curs.fetchall()
print(rows)

(('111', '111', '111', '111', None), ('1111', 'qqq', 'qqq', 'qqq', None), ('12', '12', '12', '12', None), ('123', '최수훈', '경제', '12345678', None), ('1231', '123', '123', '123', None), ('1234', '1234', '1234', '1234', None), ('aaa', '111', '111', '111', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S100', '박소명', '컴퓨터공학과', '123-4567', None))

In [66]:
# list로 변환
rowList = list(rows)
print(rowList)

[('111', '111', '111', '111', None), ('1111', 'qqq', 'qqq', 'qqq', None), ('12', '12', '12', '12', None), ('123', '최수훈', '경제', '12345678', None), ('1231', '123', '123', '123', None), ('1234', '1234', '1234', '1234', None), ('aaa', '111', '111', '111', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S100', '박소명', '컴퓨터공학과', '123-4567', None)]

In [67]:
print(rowList[0])

('111', '111', '111', '111', None)

In [68]:
conn.close()

# select 의 내용을 dataframe으로 보기

In [69]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\dkehs\anaconda3\lib\site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dkehs\anaconda3\lib\site-packages (from sqlalchemy) (1.0.0)

In [70]:
import pandas as pd
from sqlalchemy import create_engine

In [71]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [72]:
data = pd.read_sql_table('student', conn)
data

   scode sname   sdept    sphone saddress
0    111   111     111       111     None
1   1111   qqq     qqq       qqq     None
2     12    12      12        12     None
3    123   최수훈      경제  12345678     None
4   1231   123     123       123     None
5   1234  1234    1234      1234     None
6    aaa   111     111       111     None
7   S002   최민국  컴퓨터공학과  234-5678     None
8   S005   김상진     사학과  567-8901     None
9   S006   황정숙     사학과  678-9012     None
10  S100   박소명  컴퓨터공학과  123-4567     None

# dataFrame 을 Database로 insert하기

In [76]:
column = ['rank', 'title']
movies = pd.read_csv("./Data/DaumList.csv")
movies.columns = column
movies.head()

   rank                           title
0     1  Parasite (Gisaengchung) (2019)
1     2        Avengers: Endgame (2019)
2     3               Knives Out (2019)
3     4                       Us (2019)
4     5              Toy Story 4 (2019)

In [78]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum?", convert_unicode=True)
conn = engine.connect()

In [79]:
movies.to_sql(name = 'movies', con = engine, if_exists='append', index=False)